
{
  "courseTitle": "Data Analytics",
  "tagline": "Turn Data Into Actionable Insights",
  "description": "This Data Analytics course is built for those who want to understand, analyze, and visualize data effectively. You'll learn industry-relevant tools and techniques to uncover patterns, make data-driven decisions, and present findings clearly. Whether you're starting out or upskilling, this course will guide you through real-world scenarios with hands-on projects.",
  "whatIsML": "Data Analytics is the science of examining raw data to uncover useful information, draw conclusions, and support decision-making. It includes data collection, processing, visualization, and interpretation. Unlike Machine Learning, Data Analytics is more focused on understanding and explaining past data rather than predicting future outcomes.",
  "videoPoster": "/videos/da.png",
  "videoPath": "/videos/data.mp4",
  "whatYouWillLearn": [
    "Data Analysis Workflow: Understand the complete cycle from raw data to decision-making.",
    "Excel & Google Sheets: Perform statistical analysis and clean data using spreadsheet tools.",
    "SQL for Data Analytics: Query, filter, and aggregate data from relational databases.",
    "Python for Analytics: Use libraries like pandas, NumPy, and Matplotlib for in-depth analysis."
  ],
  "courseHighlights": [
    "Descriptive, Diagnostic, and Exploratory Analysis",
    "Hands-on Projects with Real Datasets",
    "End-to-End Data Cleaning Techniques",
    "Tools: Excel, SQL, Python, Tableau, Power BI",
    "Key Metrics & KPIs for Different Industries",
    "Automating Reports & Dashboarding"
  ],
  "courseModules": [
    {
      "title": "Introduction to Data Analytics",
      "description": "Learn the fundamentals of data analytics, its importance in today's world, and different types of data analysis (descriptive, diagnostic, predictive, prescriptive)."
    },
    {
      "title": "Working with Excel and Google Sheets",
      "description": "Explore the use of spreadsheets for cleaning, sorting, filtering, and analyzing data. Learn to use formulas, pivot tables, and charts effectively."
    },
    {
      "title": "Mastering SQL for Data Analysis",
      "description": "Write queries to retrieve, join, group, and filter data from relational databases. Practice with large datasets and real-world case studies."
    },
    {
      "title": "Python for Data Analytics",
      "description": "Use Python with pandas, NumPy, and Matplotlib to clean, manipulate, and visualize data. Learn how to automate repetitive analysis tasks."
    },
    {
      "title": "Data Cleaning & Preprocessing",
      "description": "Understand how to handle missing data, outliers, duplicates, and data type conversions to prepare data for meaningful analysis."
    },
    {
      "title": "Data Visualization with Tableau & Power BI",
      "description": "Create interactive charts, dashboards, and reports that clearly communicate findings using industry-standard visualization tools."
    },
    {
      "title": "Business Case Studies & KPIs",
      "description": "Apply data analysis to real business problems like customer churn, sales forecasting, and marketing performance tracking."
    },
    {
      "title": "Storytelling with Data",
      "description": "Learn to present data insights in a way that drives action. Focus on narrative structure, visual clarity, and executive presentation."
    },
    {
      "title": "End-to-End Capstone Project",
      "description": "Work through a complete project: define the question, gather and clean data, analyze, visualize, and present your insights in a dashboard."
    },
    {
      "title": "Certification & Career Path Guidance",
      "description": "Receive your course certificate and get tips on building a portfolio, preparing for interviews, and choosing a career path in analytics."
    }
  ]
}
