{
  "courseTitle": "Generative AI",
  "tagline": "Create the Future with Intelligent Generative Systems",
  "description": "This Generative AI course is designed to equip learners with cutting-edge knowledge of AI models that generate content—whether text, images, audio, or code. From mastering the fundamentals of transformers to building your own generative tools, you'll gain the skills needed to work with the most exciting advancements in AI today.",
  "whatIsML": "Generative AI refers to a class of artificial intelligence models that can generate new content by learning patterns from existing data. Unlike traditional AI that classifies or predicts, generative models create—writing poems, generating images, composing music, or even coding. It's powered by advanced models like GANs, VAEs, and Transformers, including GPT, DALL·E, and Stable Diffusion.",
  "whatYouWillLearn": [
    "Fundamentals of Generative AI: Understand how these models work and what sets them apart.",
    "Text Generation with Transformers: Use models like GPT to create human-like text.",
    "Image Generation: Learn how GANs and diffusion models generate realistic images.",
    "Prompt Engineering: Master the skill of crafting prompts to guide model outputs.",
    "Build Your Own Generative Apps: Use APIs like OpenAI, Stability AI, or Hugging Face.",
    "Ethics & Risks in Generative AI: Explore safety, bias, and responsible usage."
  ],
  "courseHighlights": [
    "Core Concepts of Generative AI",
    "Hands-on with GPT, DALL·E, and Stable Diffusion",
    "Building AI-Powered Chatbots & Tools",
    "Prompt Engineering & Zero-Shot Learning",
    "Training Custom Generative Models",
    "Ethical Considerations & Limitations"
  ],
  "courseModules": [
    {
      "title": "Introduction to Generative AI",
      "description": "Get an overview of what generative AI is, its rise, and the breakthrough technologies like Transformers that made it possible."
    },
    {
      "title": "Language Models & Transformers",
      "description": "Understand how transformer-based models work, with hands-on experience using GPT and other LLMs for text generation."
    },
    {
      "title": "Prompt Engineering & Fine-Tuning",
      "description": "Learn how to guide large models with effective prompts and how to fine-tune models on specific tasks or datasets."
    },
    {
      "title": "Text-to-Image Generation",
      "description": "Explore how models like DALL·E and Stable Diffusion create images from text, and experiment with your own generation pipelines."
    },
    {
      "title": "Image & Audio Generation with GANs and VAEs",
      "description": "Dive into Generative Adversarial Networks (GANs) and Variational Autoencoders (VAEs) to build models that create visuals and sounds."
    },
    {
      "title": "Code Generation & AI Pair Programming",
      "description": "Use models like Codex to generate code, build autocompletion tools, and integrate AI into your development workflow."
    },
    {
      "title": "Building Generative AI Applications",
      "description": "Build web apps and APIs using models from OpenAI, Hugging Face, or custom-trained networks for real-world applications."
    },
    {
      "title": "Ethical AI & Safety Challenges",
      "description": "Analyze the risks, biases, and ethical considerations of generative AI, including content authenticity and hallucinations."
    },
    {
      "title": "Generative AI in Industry",
      "description": "Discover how businesses are using generative AI in marketing, design, gaming, entertainment, and productivity tools."
    },
    {
      "title": "Capstone Project & Certification",
      "description": "Develop your own generative AI solution—like an AI story writer, image generator, or chatbot—and earn a certificate of completion."
    }
  ]
}
