{
  "courseTitle": "Neural Networks",
  "tagline": "Understand the Brains Behind AI",
  "description": "This Neural Networks course is designed to give you a solid foundation in how artificial neurons mimic the human brain to power modern AI systems. You'll learn to build, train, and optimize neural networks from scratch using Python and deep learning frameworks like TensorFlow and PyTorch.",
  "whatIsML": "Neural Networks are a subset of Machine Learning models inspired by the human brain. They consist of layers of interconnected nodes (neurons) that process input data and learn complex patterns. Neural networks are the foundation of many modern AI systems, including image recognition, natural language processing, and autonomous systems.",
  "videoPoster": "/videos/nn.png",
  "videoPath": "/videos/network.mp4",
  "whatYouWillLearn": [
    "Foundations of Neural Networks: Learn how perceptrons and multilayer networks work.",
    "Activation Functions: Understand ReLU, Sigmoid, Tanh, and how they influence learning.",
    "Forward and Backward Propagation: Dive into how data flows through the network and how errors are corrected.",
    "Building Neural Networks with Python: Use TensorFlow and PyTorch for real-world applications."
  ],
  "courseHighlights": [
    "Understand Biological vs Artificial Neurons",
    "From Perceptrons to Deep Feedforward Networks",
    "Hands-on Implementation in TensorFlow and PyTorch",
    "Model Training, Loss Functions & Optimizers"
  ],
  "courseModules": [
    {
      "title": "Introduction to Neural Networks",
      "description": "Understand the biological inspiration behind neural networks, the history of the field, and where neural networks fit in the AI ecosystem."
    },
    {
      "title": "The Perceptron and Activation Functions",
      "description": "Learn the mechanics of a single-layer perceptron, linear separability, and common activation functions like ReLU and Sigmoid."
    },
    {
      "title": "Multilayer Neural Networks",
      "description": "Understand how multiple layers increase representational power and how deep networks are structured."
    },
    {
      "title": "Forward and Backward Propagation",
      "description": "Explore the learning process of neural networks, focusing on gradient descent, loss functions, and backpropagation algorithms."
    },
    {
      "title": "Building Neural Networks in TensorFlow",
      "description": "Use TensorFlow to create, compile, train, and evaluate your first neural network model."
    },
    {
      "title": "PyTorch Implementation of Neural Networks",
      "description": "Build the same models in PyTorch to understand flexibility and control in neural network training."
    },
    {
      "title": "Regularization Techniques",
      "description": "Apply techniques like L2 regularization, Dropout, and Batch Normalization to prevent overfitting."
    },
    {
      "title": "Hyperparameter Optimization",
      "description": "Learn how to tune key parameters like learning rate, number of hidden units, and epochs for better performance."
    },
    {
      "title": "Advanced Topics & Architectures",
      "description": "Touch on convolutional and recurrent networks as extensions to standard feedforward networks."
    },
    {
      "title": "Capstone Project & Certification",
      "description": "Build a real-world application (e.g., handwritten digit recognizer or simple sentiment analyzer) and receive certification on completion."
    }
  ]
}
