{
  "courseTitle": "Deep Learning",
  "tagline": "Master Neural Networks and Build Intelligent Systems",
  "description": "This hands-on Deep Learning course is designed to take you from beginner to advanced in building and training neural networks. Whether you're an aspiring data scientist, software developer, or AI enthusiast, you'll gain practical experience with powerful deep learning frameworks and techniques used in the real world.",
  "whatIsML": "Deep Learning is a subset of Machine Learning that uses algorithms inspired by the structure and function of the brain, known as artificial neural networks. It's behind cutting-edge innovations like voice assistants, self-driving cars, and real-time language translation. With large datasets and computational power, deep learning models can achieve unprecedented levels of accuracy and performance.",
  "videoPoster": "/videos/dl.png",
  "videoPath": "/videos/deep.mp4",
  "whatYouWillLearn": [
    "Understand Neural Networks: Dive into how perceptrons, activation functions, and backpropagation work.",
    "Train Deep Networks: Learn to build and train multi-layered neural networks using TensorFlow or PyTorch.",
    "Convolutional Neural Networks (CNNs): Master image classification and object detection."
  ],
  "courseHighlights": [
    "Neural Networks from Scratch",
    "Backpropagation and Optimization Techniques",
    "Image Recognition using CNNs",
    "Natural Language Processing with RNNs and Transformers",
    "Transfer Learning with Pretrained Models",
    "Deployment with Flask, FastAPI, or TensorFlow Serving"
  ],
  "courseModules": [
    {
      "title": "Introduction to Deep Learning",
      "description": "Understand the foundations of deep learning, differences from machine learning, and its revolutionary applications in AI."
    },
    {
      "title": "Neural Networks Fundamentals",
      "description": "Learn about neurons, layers, activation functions, forward propagation, and the math behind neural networks."
    },
    {
      "title": "Backpropagation & Optimization",
      "description": "Grasp how neural networks learn through gradient descent, loss functions, and optimizers like Adam and SGD."
    },
    {
      "title": "Convolutional Neural Networks (CNNs)",
      "description": "Explore how CNNs revolutionized computer vision and build models for tasks like digit recognition and object detection."
    },
    {
      "title": "Recurrent Neural Networks (RNNs) & LSTMs",
      "description": "Understand how RNNs handle sequential data and build models for sentiment analysis, language modeling, and speech tasks."
    },
    {
      "title": "Natural Language Processing & Transformers",
      "description": "Use embeddings and attention mechanisms, and work with BERT and GPT-based architectures for NLP applications."
    },
    {
      "title": "Transfer Learning & Fine-Tuning",
      "description": "Speed up training and boost performance with pre-trained models, and adapt them to new tasks using fine-tuning."
    },
    {
      "title": "Generative Models: Autoencoders & GANs",
      "description": "Learn how to generate new data using autoencoders and GANs. Understand real use cases like image generation and style transfer."
    },
    {
      "title": "Deploying Deep Learning Models",
      "description": "Package your models with Flask or FastAPI, build APIs, and deploy them to cloud platforms or mobile devices."
    },
    {
      "title": "Capstone Project & Certification",
      "description": "Apply your skills in a real-world project—like face mask detection, language translation, or music generation—and earn your certificate."
    }
  ]
}
