{
  "courseTitle": "Machine Learning",
  "tagline": "Unlock the Power of Intelligent Systems",
  "description": "This comprehensive Machine Learning course is designed to equip you with the skills needed to build smart, data-driven applications. Whether you're a beginner or a tech enthusiast looking to level up, this course provides a hands-on approach to mastering ML concepts, tools, and techniques used in the industry.",
  "whatIsML": "Machine Learning (ML) is a powerful subfield of Artificial Intelligence (AI) that gives computers the ability to learn from experience—without being explicitly programmed. In traditional programming, developers write rules that define every action a program must take. In contrast, machine learning models learn patterns from data, enabling systems to adapt, make decisions, and improve automatically as more data becomes available.",
  "whatYouWillLearn": [
    "Understand ML Algorithms: Learn how algorithms like KNN, Naive Bayes, and SVM work under the hood.",
    "Data Preprocessing: Clean, normalize, and prepare datasets for better results.",
    "Model Training & Evaluation: Split data, avoid overfitting, and measure model accuracy.",
    "Hyperparameter Tuning: Use techniques like Grid Search and Cross-Validation to improve models."
  ],
  "courseHighlights": [
    "Foundations of Machine Learning",
    "Supervised & Unsupervised Learning Techniques",
    "Classification & Regression Models",
    "Support Vector Machines (SVM), Decision Trees & Random Forests",
    "Model Optimization & Performance Tuning",
    "Dimensionality Reduction & Feature Engineering"
  ],
  "courseModules": [
    {
      "title": "Introduction to Machine Learning",
      "description": "Understand what Machine Learning is, its types (supervised, unsupervised, reinforcement), real-world applications, and how it's transforming industries."
    },
    {
      "title": "Data Wrangling & Preprocessing",
      "description": "Learn how to clean, prepare, and transform raw data into usable formats. Includes handling missing values, encoding categorical data, and feature scaling."
    },
    {
      "title": "Supervised Learning: Regression",
      "description": "Dive into regression techniques like Linear Regression and Polynomial Regression to predict continuous values from input data."
    },
    {
      "title": "Supervised Learning: Classification",
      "description": "Learn classification algorithms such as Logistic Regression, K-Nearest Neighbors (KNN), and Support Vector Machines (SVM) for categorizing data points."
    },
    {
      "title": "Unsupervised Learning & Clustering",
      "description": "Explore techniques like K-Means and Hierarchical Clustering to discover hidden patterns and groupings in unlabeled data."
    },
    {
      "title": "Ensemble Models: Bagging & Boosting",
      "description": "Boost your model accuracy using ensemble techniques like Random Forest, AdaBoost, and Gradient Boosting by combining multiple models."
    },
    {
      "title": "Model Evaluation & Hyperparameter Tuning",
      "description": "Master evaluation metrics (Accuracy, Precision, Recall, F1-Score) and optimize models using techniques like Grid Search and Cross-Validation."
    },
    {
      "title": "Introduction to Deep Learning",
      "description": "Get started with the basics of neural networks, activation functions, and how deep learning is used in image, text, and speech processing."
    },
    {
      "title": "Real-World Projects",
      "description": "Apply everything you've learned to real-world datasets – such as loan prediction, customer segmentation, or sentiment analysis – using Python and popular ML libraries."
    },
    {
      "title": "Capstone Project & Certification",
      "description": "Work on a final project to demonstrate your skills from start to finish and earn a certificate to showcase your achievement to employers or on LinkedIn."
    }
  ]
}
